#include<stdio.h>
int main (){
	FILE* file;
	int i;
	char name[52][10]={"武磊","肖智","韦世豪","于洋","王大雷","石柯","刘洋","张旭日","朴成","于大宝","刘奕鸣","张呈栋","洛里斯","瓦拉内","姆巴佩","门迪","托利索","勒马尔","里瓦尔多",
	                    "郝迪拉","穆斯塔菲","浩维德斯","迪巴拉","伊瓜因","肯佩斯","罗霍","梅西","姆巴佩","罗纳尔多","苏亚雷斯","穆勒","钱德勒","格雷兹曼","阿奎罗","佩雷斯","鲁尼","桑托斯","齐拉内","冈萨雷斯","马拉多纳","贝克","卡卡","吉鲁","马图依迪","登贝莱","帕瓦尔","杜尔姆","克罗斯",
							"阿库尼亚","佩雷斯","梅尔卡多","巴内加"};
	file=fopen("playerHZ.dat","wb");
	fseek(file,0L,SEEK_SET);
	for(i=0;i<=52;i++)
	{
		fwrite(name[i],1,10,file);
	}
	fclose(file);
}